app/controllers/flights_controller.rb

  def index
    @flights = Flight.all
---
SELECT "flights".* FROM "flights"

  def search
    @searches = Flight.where(origin: params[:origin]).where(destination: params[:destination])#, Flight.where("destination = #{params[:destination]}")]
---
SELECT "flights".* FROM "flights" WHERE "flights"."origin" = $1 AND "flights"."destination" = $2  [["origin", "Brisbane"], ["destination", "Perth"]]